modules/Hotel/Controllers/HotelHController.php

select `image_url`, `hotel_id` from `hotel_images` where `hotel_id` in ('zzz_test_hotel1', 'test_hotel_do_not_book', 'test_hotel_5', 'testhotel_berlin', 'test_hotel_15', 'test_hotel', 'test_hotel_only_do_not_use_3', 'pcln_hotel_test_do_not_book', 'hotel_grant_sanktpeterburg_otel_dlya_testirovaniya', 'test_hotel_do_not_use_it_30_01') group by `hotel_id`
---
            $hotelIds = $hotels->pluck('hotel_id')->toArray();

            // Batch fetch hotel images
            $hotelImages = DB::table('hotel_images')
                ->whereIn('hotel_id', $hotelIds)
                ->groupBy('hotel_id')
                ->pluck('image_url', 'hotel_id');